Revit 2026 API

# EnergyDataSettingsAnalyticalGridCellSize Property

---

The cell size for the uniform cubical grid used when computing the building envelope

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AnalyticalGridCellSize { get; set; }
```
```vb
Public Property AnalyticalGridCellSize As Double
	Get
	Set
```
```cpp
public:
property double AnalyticalGridCellSize {
	double get ();
	void set (double value);
}
```
```fsharp
member AnalyticalGridCellSize : float with get, set
```

#### Property Value

Double

This is the size of the "cubes" used to divide the building shell bounding box into a uniform cubical 3D grid.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace